import math

# 计算100的阶乘, 158位整数
print(math.factorial(100))

# 浮点数无法保证完全精确,输出时只保留17位有效数字
print(43.02 * 7)
# 预期输出: 301.14
# 实际结果: 301.14000000000004

print(5.02 / 0.1)
# 预期输出: 50.20
# 实际结果: 50.199999999999996

# 浮点数表示的数字范围为1.7 * (10**-308) ~ 1.7 * (10**308 )
print(pow(809.0, 106))  # 输出结果为809的106次幂的值
# 输出结果: 1.748007496839708e+308

# print(pow(810.0, 106))  # 输出结果为809的106次幂的值
# 输出结果: OverflowError: (34, 'Result too large')

# 复数
print((3.0 + 4.0j).real)   # 输出实部结果: 3.0
print((3.0 + 4.0j).imag)   # 输出虚部结果: 4.0
print(abs(3.0 + 4.0j))   # 输出复数的模: 5.0